Repository: Latand/Passcypher_bot
Catalog: locales/*/LC_MESSAGES/pcypher.po
Languages: ru, uk

source: https://telegra.ph/How-to-Use-Passcypher-Instruction-EN-06-02
ru: https://telegra.ph/Kak-ispolzovat-Passcypher-Instrukciya-06-03
uk: https://telegra.ph/Kak-ispolzovat-Passcypher-Instrukciya-06-03

source: Please enter your master password. You can make everything faster with Google Authenticator! Press /g_auth_info
ru: Введите свой мастер пароль, который вы хорошо помните. <b> БОТ УДАЛЯЕТ СООБЩЕНИЯ С ПАРОЛЯМИ ЧЕРЕЗ 10 СЕКУНД</b> Ускорьте процесс с помощью Google Authenticator! Нажми для подробной информации /g_auth_info
uk: Введіть свій мастер пароль, котрий вы гарно пам`ятаєте. <b> БОТ ВИДАЛЯЄ повідомлення з паролем ЧЕРЕЗ 10 СЕКУНД </b> Пришвидшіть процес за допомогою Google Authenticator! Натисніть для подальшої інформації /g_auth_info

source: Enter phrase you want to encrypt. It should be under 400 characters, for best results there should be only characters from this list: <pre>{allowed_chars} </pre> <b> THE BOT DELETES YOUR MESSAGES WITH PASSWORDS AFTER 10 SECONDS</b>
ru: Введите пароль, который хотите зашифровать. Он должен быть длиной до 400 символов и рекомендуется для лучшего результата использовать символы только из этого списка: <pre>{allowed_chars} </pre>
uk: Введіть пароль, котрий бажаєте зашифрувати. Він повинен бути довжиною до 400 символів та рекомендується задля кращого результату використовувати символи тільки з цього списку: <b> БОТ ВИДАЛЯЄ повідомлення з паролем ЧЕРЕЗ 10 СЕКУНД </b> <pre>{allowed_chars} </pre>

source: https://telegra.ph/Passwords-Decryption-Process-06-02
ru: https://telegra.ph/Process-deshifrovki-parolej-06-09
uk: https://telegra.ph/Process-deshifrovki-parolej-06-09

source: Hello, <b>{}</b> Let's choose your language
ru: Привет, <b>{}</b> Давай выберем твой язык

source: https://telegra.ph/Passcypher-Google-Authenticator-06-02
ru: https://telegra.ph/Passcypher-Ispolzovanie-Google-Authenticator-06-07
uk: https://telegra.ph/Passcypher-Ispolzovanie-Google-Authenticator-06-07

source: Here you can enable and disable your Google Authenticator settings
ru: Тут вы можете включать и выключать настройки Google Authenticator
uk: Тут ви маєте змогу увімкнути та вимкнути налаштування Google Authenticator

source: Turn off
ru: Выключить
uk: Вимкнути

source: Turn on
ru: Включить
uk: Увімкнути

source: Google Authenticator is not set for you. Press /g_auth_info
ru: Вы еще не настраивали Google Authenticator. Нажмите /g_auth_info
uk: Ви ще не налаштовували Google Authenticator. Натисніть /g_auth_info

source: Error. Wrong file
ru: Ошибка. Неподдерживаемый файл
uk: Помилка. Невірний файл.

source: Enter the code from the app
ru: Введите код из приложения
uk: Введіть код з додатку

source: Error
ru: Ошибка
uk: Помилка

source: INVALID FILE
ru: Неподдерживаемый файл
uk: Невірний файл.

source: An error has occurred, you lost the Google authenticator settings Please re-configure it once again /g_auth_info
ru: Произошла ошибка, у вас сбилась настройка Google authenticator Пожалуйста, настройте его заново /g_auth_info
uk: Сталася помилка, у вас збилася настройка Google authenticator. Будь ласка, налаштуйте його заново. /g_auth_info

source: Code is incorrect, try again or /cancel
ru: Код неверный, попробуйте снова или отмените /cancel
uk: Хибний код, спробуйте знов або скасуйте /cancel

source: Your decoded password is inside citation marks '<code>{password}</code>'
ru: Ваш расшифрованный пароль находится внутри кавычек '<code>{password}</code>'
uk: Ваш розшифрований пароль знаходиться всередені лапок '<code>{password}</code>'

source: Error has occurred... Too long phrase. Try to enter a phrase under 400 characters.
ru: Ошибочка произошла... Слишком длинный пароль. постарайтесь ввести пароль длиной до 400 символов.
uk: Виникла помилочка... Занадто довгий пароль. Будьласка введіть пароль довжиною до 400 символів.

source: Master Password not found.
ru: Мастер пароль был не найден, попробуйте заново
uk: Майстер пароль не був знайдений

source: <code>---------------------------- ENCRYPTION STARTS HERE ---------------------------- {passw} ---------------------------- ENCRYPTION ENDS HERE ---------------------------- CODE {code} ---------------------------- </code> Hint: {hint} Save this message wherever you want and forward it to the bot should you need to decode it.
ru: <code>---------------------------- ENCRYPTION STARTS HERE ---------------------------- {passw} ---------------------------- ENCRYPTION ENDS HERE ---------------------------- CODE {code} ---------------------------- </code> Подсказка: {hint} Сохраните это сообщение где угодно и перешлите боту когда захотите расшифровать свой пароль.
uk: <code>---------------------------- ENCRYPTION STARTS HERE ---------------------------- {passw} ---------------------------- ENCRYPTION ENDS HERE ---------------------------- CODE {code} ---------------------------- </code> Підказка: {hint} Збережіть цю інформацію де вам зручно, та звертайтесь до бота, коли вам знодиться розшифрувати пароль.

source: To encrypt your phrase/file you need to enter a master password each time you want to encrypt or decrypt, or you can enable <b>Google Authenticator</b> and enter one-time codes from your phone <b>only to decrypt</b> your passwords. (Master password will be kept in database then) Please make your choice (you can change it later with command /reset_google_auth
ru: Чтобы зашифровать файл/пароль вы должны вводить мастер пароль каждый раз, чтобы зашифровать\n или расшифровать. Но вы можете включить Google Authenticator и вводить одноразовые пароли со своего телефона \n<b>только для расшифровки</b> своих паролей (Но тогда мастер пароль будет храниться в нашей базе данных Сделайте свой выбор (вы сможете позже отключать эту функцию с помощью команды /reset_google_auth )

source: Setup
ru: Начать настройку
uk: Почати налаштування

source: Password not found.
ru: Пароль не был найден, попробуйте заново
uk: Пароль не був знайдений

source: ---------------------------- ENCRYPTION STARTS HERE ---------------------------- {passw} ---------------------------- ENCRYPTION ENDS HERE ---------------------------- CODE {code} ---------------------------- Hint: {hint}
ru: <code>---------------------------- ENCRYPTION STARTS HERE ---------------------------- {passw} ---------------------------- ENCRYPTION ENDS HERE ---------------------------- CODE {code} ---------------------------- </code> Подсказка: {hint}
uk: <code>---------------------------- ENCRYPTION STARTS HERE ---------------------------- {passw} ---------------------------- ENCRYPTION ENDS HERE ---------------------------- CODE {code} ---------------------------- </code> Підказка: {hint}

source: 🔒 Encode
ru: 🔒 Зашифровать
uk: 🔒 Зашифрувати

source: 🔑 Decode
ru: 🔑 Расшифровать
uk: 🔑 Розшифрувати

source: ℹ️How to use
ru: ℹ️Как использовать
uk: ℹ️Як використовувати

source: 🇬🇧 Set language
ru: 🇷🇺 Сменить язык
uk: 🇺🇦 Змінити мову

source: 🔐 Two step verification
ru: 🔐 Двухэтапная верификация
uk: 🔐 Двохетапна верифікація

source: 📝 Write a review
ru: 📝 Оставить отзыв
uk: 📝 Залишити відгук

source: Language has changed to 🇬🇧<b>EN</b> <b>{users}</b> users are using this bot. <b>{passwords}</b> passwords encrypted. <b>{messages}</b> messages received. Start using this bot: /info
ru: Язык был изменен на 🇷🇺<b>RU</b> <b>{users}</b> Пользователей используют этого бота. <b>{passwords}</b> паролей зашифровано. <b>{messages}</b> сообщений обработано. Начните использовать этого бота: /info
uk: Мова була змінена на <b>UA</b> <b>{users}</b> Користувачів використовують цього бота. <b>{passwords}</b> паролів зашифровано. <b>{messages}</b> повідомлень оброблено. Почните користуватися ботом: /info

source: <b>{users}</b> users are using this bot. <b>{passwords}</b> passwords encrypted. <b>{messages}</b> messages received.
ru: <b>{users}</b> Пользователей используют этого бота. <b>{passwords}</b> паролей зашифровано. <b>{messages}</b> сообщений обработано.
uk: <b>{users}</b> Користувачів використовують цього бота. <b>{passwords}</b> паролів зашифровано. <b>{messages}</b> повідомлень оброблено.

source: Looks like the input is invalid... To decode your password - forward the message with encoded password you received from bot. <a href= 'https://telegra.ph/file/a9f99684284a92eb2a6a0.png'>ᅠ</a> Perhaps you wanted to encrypt this message? Click
ru: Похоже, что вы ввели неверный запрос... Для того, чтобы раскодировать - пришлите сообщение, которое вы получили от бота с закодированным паролем. <a href= 'https://telegra.ph/file/a9f99684284a92eb2a6a0.png'>ᅠ</a> Возможно вы хотели зашифровать это сообщение? Нажмите

source: Or setup the language again /set_language
ru: Или смените язык командой /set_language

source: Seems like you have an unfinished business...
ru: Похоже, что вы не закончили что-то... (прочитайте предыдущие сообщения)
uk: Схоже, у вас є незакінчена справа...

source: Please, it is important for me to receive a response and advice from you. How would you change the bot? Any comments are appreciated. Your comment will be posted <b>anonymously</b> in our channel @pcypher Or you can just rate the bot using this link: https://t.me/pcypher/16
ru: Для меня очень важно ваше мнение и любой отзыв о боте. Что бы вы сделали лучше, что бы вы изменили? Любая помощь оценится. Ваш комментарий будет опубликован в нашем канале @pcypher абсолютно анонимно. Или вы можете поставить оценку боту по этой ссылке: https://t.me/pcypher/16
uk: Для мене дуже важливо ваша думка та будь-який відгук про бота. Що ви б покращили або змінили? Будь-яка допомога буде цінитись. Ваш коментарій буде опублікований на нашому каналі @pcypher абсолютно анонімно. Або ви можете поставити оцінку боту за цим посиланням: https://t.me/pcypher/16

source: Give an advice to the bot
ru: Дать совет боту
uk: Надати пораду ботові

source: Your advice: {advice} Write your advice in the next message.
ru: Ваш совет: {advice} Напишите ваш совет боту в следующем сообщении.
uk: Ваша порада: {advice} Напишіть вашу пораду ботові у наступному повідомленні.

source: Cancel
ru: Отмена
uk: Скасувати

source: Publish
ru: Опубликовать отзыв
uk: Опубліковати відгук

source: Cancelled
ru: Отменено
uk: Скасовано

source: That is done
ru: Готово
uk: Готово

source: You have already received the Google Authenticator code
ru: Вы уже настраивали Google Authenticator
uk: Ви вже налаштовували Google Authenticator

source: Please ensure you have the app installed. <a href= "https://itunes.apple.com/gb/app/google-authenticator/id388497605?mt=8">IOS</a> <a href= "https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2&hl=en_GB">Android</a> Press continue when you done. After you receive the code - write it down somewhere.
ru: Для начала убедитесь, что у вас установлено приложение. <a href= "https://itunes.apple.com/gb/app/google-authenticator/id388497605?mt=8">IOS</a> <a href= "https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2&hl=en_GB">Android</a> Нажмите продолжить когда закончите, после того как получите код - запишите его где нибудь.
uk: Зпочатку переконайтесь, що в вас встановлений додаток. <a href= "https://itunes.apple.com/gb/app/google-authenticator/id388497605?mt=8">IOS</a> <a href= "https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2&hl=en_GB">Android</a> Натисніть продовжити коли закінчите, після того як отрумаєте код - запишіть його де-небудь.

source: Continue
ru: Продолжить
uk: Продовжити

source: Please press on button to continue or /cancel
ru: Пожалуйста, нажмите продолжить для того, чтобы настроить, или нажмите отмена /cancel
uk: Будь ласка, натисніть продовжити для того, щоб налаштувати, або натисніть для скасування /cancel

source: You will receive a recovery code and a link below. <b>IT WILL BE AUTOMATICALLY DELETED AFTER YOU CONFIRM</b>
ru: Вы получите код для восстановления ниже . <b>СООБЩЕНИЕ БУДЕТ УДАЛЕНО ПОСЛЕ ПОДТВЕРЖДЕНИЯ</b>
uk: Ви отримуєте код для відновлення нижче . <b>ПОВІДОМЛЕННЯ БУДЕ ВИДАЛЕНЕ ПІСЛЯ ПІДТВЕРДЖЕННЯ</b>

source: Please enter the code from the Google Authenticator Pay attention that it updates every 30 sec.
ru: Пожалуйста введите код который вы получили в Google Authenticator Обратите внимание, что код обновляется каждые 30 сек
uk: Будьласка введить код котрий ви отримали в Google Authenticator Зверніть увагу, що код оновлюється кожні 30 сек

source: Confirmation successful, you can proceed. /encode
ru: Успешно подтверждено, можете продолжать. /encode
uk: Успішно підтверджено, продовжуйте. /encode

source: Please enter your master password. You can make everything faster with Google Authenticator! Press /g_auth_info
uk: Введіть свій мастер пароль, котрий вы гарно пам`ятаєте. <b> БОТ ВИДАЛЯЄ повідомлення з паролем ЧЕРЕЗ 10 СЕКУНД </b> Пришвидшіть процес за допомогою Google Authenticator! Натисніть для подальшої інформації /g_auth_info

source: To encrypt your phrase/file you need to enter a master password each time you want to encrypt or decrypt, or you can enable <b>Google Authenticator</b> and enter one-time codes from your phone <b>only to decrypt</b> your passwords. (Master password will be kept in database then) Please make your choice (you can change it later with command /reset_google_auth
uk: Щоб зашифрувати файл/пароль ви повинні вводити мастер пароль кожного разу, щоб зашифрувати\n або розшифрувати. Але ви можете увімкнути Google Authenticator та вводити одноразові паролі зі свого телефону \n<b>тільки для розшифровки</b> своїх паролей (Але тоді мастер пароль буде зберігатися в нашій базі даних Зробіть свій вибір (ви маєте змогу пізніше відключити цю функцію за допомогою команди /reset_google_auth )

source: <code>---------------------------- ENCRYPTION STARTS HERE ---------------------------- {passw} ---------------------------- ENCRYPTION ENDS HERE ---------------------------- CODE {code} ---------------------------- </code> Hint: {hint} Save this message wherever you want and forward it to the bot should you need to decode it.
uk: <code>---------------------------- ENCRYPTION STARTS HERE ---------------------------- {passw} ---------------------------- ENCRYPTION ENDS HERE ---------------------------- CODE {code} ---------------------------- </code> Підказка: {hint} Збережіть цю інформацію де вам зручно, та звертайтесь до бота, коли вам знодиться розшифрувати пароль.

source: Looks like the input is invalid... To decode your password - forward the message with encoded password you received from bot. <a href= 'https://telegra.ph/file/a9f99684284a92eb2a6a0.png'>ᅠ</a> Perhaps you wanted to encrypt this message? Click <b> Encrypt </b>.
uk: Схоже, що ви ввели хибний запит... Задля того, щоб розкодувати - перешліть повідомлення, котре ви отримали від бота с закодованим паролем. <a href= 'https://telegra.ph/file/a9f99684284a92eb2a6a0.png'>ᅠ</a> Можливо ви хотіли зашифрувати це повідомлення? Натисніть <b> зашифрувати </b>.
